//파일명:index.js
// 서버파일 만들기

// 서버를 사용하는 이유?
//  -  브라우저가 내 정보를 보호하기 위해서 
//  - 아무 사이트나 마음대로 요청 보내지 못하게 막기위해서!
//  - 브라우저는 보안 규칙을 따라한다. 각각의  브라우저들마다 다르기때문에
//    관리하는게 힘들다!
//  - 서버랑 서버끼리는 자유롭게 통신이 가능하다!


// 1. 도구 포함
const express = require("express");
const cors = require("cors");
const axios = require("axios");

// 2. 서버 만들기
//  - *모든 포트 허용*

const app = express(); 
app.use(cors());

// 3. 경로설정
// - 리액트가 서버한테 요청함
app.get("/products",(req,res) =>{

    console.log("리액트가 요청했다!");
    res.json([
    {
      id: 1,
      name: "아이폰 16",
      price: 1200000,
      stock: 5
    },
    {
      id: 2,
      name: "갤럭시 S24",
      price: 1100000,
      stock: 3
    },
    {
      id: 3,
      name: "아이패드 프로 M4",
      price: 1490000,
      stock: 8
    },
    {
      id: 4,
      name: "맥북 에어 M3",
      price: 1590000,
      stock: 2
    },
    {
      id: 5,
      name: "에어팟 프로 2",
      price: 329000,
      stock: 15
    }
  ]);
});
// app.get("/짜장면",(req,res)=>{
//     res.send("기다리세요! 짜장면 만들고있어요!");
// })


// 4. 서버 실행
app.listen(10004, () =>{
    console.log("10004 서버 실행 중!!..💥");
})